{
    "дерево": "Многолетнее растение с твёрдым стволом и отходящими от него ветвями, образующими крону.",
    "цветок": "Орган размножения у растения, состоящий из зелёной чашечки, ярко окрашенного венчика из лепестков вокруг пестика и тычинок, а также самое растение с такими органами размножения.",
    "воздух": "Газообразное вещество, составляющее атмосферу Земли.",
    "небо": "Видимая над землёй атмосфера пространство в форме свода, купола.",
    "птица": "Покрытое перьями и пухом позвоночное животное с крыльями, двумя конечностями и клювом.",
    "лошадь": "Крупное домашнее однокопытное животное.",
    "корова": "Домашнее молочное животное, самка крупного рогатого скота, а также некоторых других рогатых животных.",
    "попугай": "Птица тропических стран с ярким и пёстрым оперением.",
    "хомяк": "Грызун, хищник, вредитель хлебных злаков.",
    "собака": "Домашнее животное из сем. хищных млекопитающих, к которому относятся также волк, лисица и др.",
    "повар": "Мастер по приготовлению пищи.",
    "архитектор": "Специалист по сооружению зданий, по архитектуре, зодчий.",
    "пожарный": "Человек борющийся с пожарами.",
    "судья": "Человек, который судит (в 1 знач.) высказывает мнение, даёт оценку.",
    "доктор": "То же, что врач.",
    "рука": "Верхняя конечность человека от плеча до пальцев, а также от запястья до пальцев.",
    "ноги": "Парный орган опоры и движения человека.",
    "голова": "Часть тела человека (или животного), состоящая из черепной коробки и лица (или морды животного).",
    "спина": "Задняя сторона туловища, простирающаяся от нижней части шеи до поясницы.",
    "живот": "Часть тела, представляющая собой брюшную полость и её стенки.",
    "баскетбол": "Игра, в которой мяч забрасывают руками в подвешенную сетку (называемую корзиной) противной партии.",
    "футбол": "Спортивная игра двух команд (по одиннадцати игроков в каждой), состоящая в том, что игроки стараются ударами ноги загнать мяч в ворота противника.",
    "бег": "Движение., передвижение, при котором быстро и резко отталкиваются ногами от земли.",
    "гольф": "Игра в мяч с клюшками, цель которой прогнать мяч по дорожкам и лункам, попав в каждую из них меньшим числом ударов.",
    "гимнастика": "Совокупность упражнений для физического развития организма."
}